Repository: MuhammadjonTohirov/novda-mobile
Catalog: lib/l10n/app_*.arb
Languages: uz

# continueButton
source: Continue
uz: Davom etish

source: Select language
uz: Tilni tanlang

# onboardingTitle1
source: Track baby's daily activities
uz: Chaqaloqning kunlik faoliyatlarini kuzating

# onboardingDescription1
source: Log feedings, sleep, diapers, and more in one simple dashboard to stay organized every day.
uz: Har kuni tartibli bo'lish uchun ovqatlanish, uyqu, tagliklar va boshqalarni bitta oddiy panelda qayd qiling.

# onboardingTitle2
source: Set reminders
uz: Eslatmalar o'rnating

# onboardingDescription2
source: Never forget a feeding or medicine, get helpful notifications right when you need them.
uz: Ovqatlanish yoki dori haqida hech qachon unutmang, kerakli paytda foydali bildirishnomalar oling.

# onboardingTitle3
source: Track Baby's Progress
uz: Chaqaloq rivojlanishini kuzating

# onboardingDescription3
source: Follow your baby's growth, routines, and celebrate every small achievement.
uz: Chaqaloqingizning o'sishi va tartibini kuzating, har bir kichik yutuqni nishonlang.

source: Height
uz: Bo'yi

source: Weight
uz: Vazni

source: Today
uz: Bugun

source: Medication
uz: Dori

source: Other
uz: Boshqa

# errorWrongFormat
source: You entered the wrong format
uz: Noto'g'ri format kiritdingiz

# errorWrongCode
source: Wrong code is entered
uz: Noto'g'ri kod kiritildi

source: Email
uz: Elektron pochta

source: Enter your email
uz: Elektron pochtangizni kiriting

# enterPhoneNumber
source: Enter your phone number
uz: Telefon raqamingizni kiriting

# phoneNumberHint
source: Phone number
uz: Telefon raqami

# receiveCodeDescription
source: You will receive a 6-digit code.
uz: Siz 6 xonali kod olasiz.

source: Terms of Use
uz: Foydalanish shartlari

source: Privacy policy
uz: Maxfiylik siyosati

# termsAcceptance
source: By clicking 'Continue' button you accept our
uz: 'Davom etish' tugmasini bosish orqali bizning shartlarimizni qabul qilasiz

# termsCheckboxAcceptance
source: By checking this box, you agree to our
uz: Ushbu katakchani belgilash orqali siz bizning shartlarimizga rozilik bildirasiz

source: and
uz: va

# enterVerificationCode
source: Enter the verification code
uz: Tasdiqlash kodini kiriting

# codeSentTo
source: We sent a 6-digit code to
uz: Biz 6 xonali kodni yuboردik

source: Resend code
uz: Kodni qayta yuborish

source: Send again after
uz: Keyin qayta yuboring

# whoIsYourBaby
source: Who's your baby?
uz: Chaqaloqingiz kim?

# selectBabyGender
source: Select your baby's gender
uz: Chaqaloqingizning jinsini tanlang

source: Boy
uz: O'g'il bola

source: Girl
uz: Qiz bola

source: App theme
uz: Ilova mavzusi

source: Auto (warm)
uz: Avto (issiq)

source: Warm
uz: Issiq

source: Cold
uz: Sovuq

# babyNameQuestion
source: What's your baby's name?
uz: Chaqaloqingizning ismi nima?

# enterBabyName
source: Enter your little one's full name
uz: Chaqaloqingizning to'liq ismini kiriting

# babyNameHint
source: Baby's name
uz: Chaqaloq ismi

# babyBirthdateQuestion
source: When was your baby born?
uz: Chaqaloqingiz qachon tug'ilgan?

# enterBabyBirthdate
source: Enter your baby's birthdate
uz: Chaqaloqingizning tug'ilgan sanasini kiriting

source: Day
uz: Kun

source: Month
uz: Oy

source: Year
uz: Yil

# babyWeightQuestion
source: What's your baby's weight?
uz: Chaqaloqingizning vazni qancha?

# enterWeightKg
source: Enter the weight in kilograms.
uz: Vaznini kilogrammlarda kiriting.

source: Weight in kg
uz: Vazni kg da

# babyHeightQuestion
source: What's your baby's height?
uz: Chaqaloqingizning bo'yi qancha?

# enterHeightCm
source: Enter the height in centimeters.
uz: Bo'yini santimetrlarda kiriting.

source: Height in cm
uz: Bo'yi sm da

source: Welcome Home
uz: Xush kelibsiz

# homeDescription
source: Your baby tracking dashboard will appear here
uz: Chaqaloqingizni kuzatish paneli shu yerda paydo bo'ladi

source: Your children
uz: Bolalaringiz

# whichChildToSelect
source: Which one do you select
uz: Qaysi birini tanlaysiz

source: Add a child
uz: Bola qo'shish

# homeMyChild
source: My child
uz: Mening farzandim

# homeEditDetails
source: Edit details
uz: Ma'lumotlarni tahrirlash

# homeNoActiveChildSelected
source: No active child selected.
uz: Faol farzand tanlanmagan.

# homeGender
source: Gender
uz: Jinsi

# homeUndisclosed
source: Undisclosed
uz: Ko'rsatilmagan

# homeActivities
source: Activities
uz: Faoliyatlar

# homeActivityHistory
source: Activity history
uz: Faoliyat tarixi

# homeReminders
source: Reminders
uz: Eslatmalar

# homeSeeAll
source: See all
uz: Barchasini ko'rish

# homeAddReminder
source: Add reminder
uz: Eslatma qo'shish

# homeNoActivityTypes
source: No activity types available yet.
uz: Hozircha faoliyat turlari mavjud emas.

# homeNoReminders
source: No reminders yet.
uz: Hozircha eslatmalar yo'q.

# homeComingSoon
source: Coming soon
uz: Tez orada

# homeFailedLoad
source: Failed to load home data.
uz: Bosh sahifa ma'lumotlarini yuklab bo'lmadi.

# homeRetry
source: Retry
uz: Qayta urinish

# homeTomorrow
source: Tomorrow
uz: Ertaga

# homeTab
source: Home
uz: Asosiy

# progressTab
source: Progress
uz: Rivojlanish

# addTab
source: Add
uz: Qo'shish

# learnTab
source: Learn
uz: O'rganish

# profileTab
source: Profile
uz: Profil

# homeLogOut
source: Log out
uz: Chiqish

# homeReminderTitle
source: {activity} reminder
uz: {activity} eslatmasi

# homeTabPlaceholder
source: {tab} tab
uz: {tab} bo'limi
